arvind-iyer/hkust-robocon/STM32F4/src/Main.cpp
/*
 * Main.cpp
 *
 *  Created on: 2015-04-02
 *      Author: William
 */

#include <inttypes.h>
#include <stm32f4xx.h>
#include <stm32f4xx_gpio.h>
#include <stm32f4xx_rcc.h>
#include <stm32f4xx_usart.h>
#include <stdio.h>
#include <cstdlib>
#include <string>
#include <Ticks.h>
#include <Leds.h>
#include <Usart.h>
#include <buzzer_song.h>
#include <can_protocol.h>
#include "stm32f4xx_can.h"
#include <can_motor.h>
#include <stm32f4xx_it.h>
#include <cmath>
#include "encoder.h"
#include <stdio.h>
#include "motor.h"
#include "gpio.h"


static int ticks_img = 655;

//void HardFault_Handler(void)	// Indicate any seg fault.
//{
//	Leds Signal6(LED_6, LED_ON);
//	while (true) {
//		if (ticks_img != Ticks::getInstance()->getTicks()) {
//			ticks_img = Ticks::getInstance()->getTicks();
//			if (Ticks::getInstance()->getFullTicks() % 2000 == 0) {
//				FAIL_MUSIC;
//				Signal6.led_toggle();
//			}
//			buzzer_check();
//		}
//	}
//}
//
//void UsageFault_Handler(void) // Any Division by 0 or relevant runtime error
//{
//	Leds Signal12(LED_12, LED_ON);
//	while (true) {
//		if (ticks_img != Ticks::getInstance()->getTicks()) {
//			ticks_img = Ticks::getInstance()->getTicks();
//			if (Ticks::getInstance()->getFullTicks() % 2000 == 0) {
//				FAIL_MUSIC;
//				Signal12.led_toggle();
//			}
//			buzzer_check();
//		}
//	}
//}
//
//void FPU_IRQHandler()
//{
//	Leds Signal12(LED_12, LED_ON);
//}

int main()
{
	Ticks ticks;

	motor drived_motor(encoder_A, encoder_B, encoder_TIM, PWM_GPIO, DIR_A, DIR_B, PWM_TIM);
	Leds::leds_init();
	can_init();
	can_rx_init();
	can_motor_init();

	while (true) {
		if (ticks_img != ticks.getTicks()) {
			ticks_img = ticks.getTicks();
			if (ticks_img % 100 == 0) {
				drived_motor.send_feedback();
			}

			// LED signal
			// Encoder
			if (!drived_motor.is_encoder_working()) {
				ENCODER_ERR_LED.on();
			} else {
				ENCODER_ERR_LED.off();
			}
			// Open or close loop or locking
			if (drived_motor.is_open_loop()) {
				OPEN_LOOP_LED.on();
				CLOSE_LOOP_LED.off();
				LOCK_LED.off();
			} else {
				if (drived_motor.get_current_vel() == 0 && drived_motor.is_encoder_working()) {
					LOCK_LED.on();
				} else {
					LOCK_LED.off();
				}
				CLOSE_LOOP_LED.on();
				OPEN_LOOP_LED.off();
			}
			// life signal
			if (ticks_img % 100 == 0) {
				LIFE_LED.led_toggle();
			}

			if (ticks_img == 0) {
				FIVE_VOLT_LED.on();
			}
		}
	}
}
